Repository: Rundiz-WP/rundiz-postorder
Catalog: App/languages/rd-postorder-*.po
Languages: th

source: Re-order posts to what you want.
th: จัดเรียงโพสต์ตามที่คุณต้องการ.

source: Post order has been reset successfully.
th: ลำดับของโพสต์ถูกล้างค่าเรียบร้อยแล้ว.

source: Re-order by dragging
th: เรียงลำดับโดยการลาก

source: Put your cursor on the row you want to re-order and drag at the up/down icon (%s) to re-order the post item.
th: วางเคอร์เซอร์บนบรรทัดที่คุณต้องการในการเปลี่ยนลำดับแล้วลากที่ไอคอนขึ้น/ลง (%s) เพื่อเรียงลำดับโพสต์.

source: Once you stop dragging and release the mouse button it will be update automatically.
th: เมื่อคุณหยุดลากและปล่อยปุ่มเมาส์แล้ว มันจะอัพเดทเองโดยอัตโนมัติ.

source: To cancel re-order while dragging, please press &quot;escape&quot; (Esc) on your keyboard.
th: การยกเลิกเรียงลำดับในขณะกำลังลาก, โปรดกดคีย์บอร์ดที่ปุ่ม &quot;escape&quot; (Esc).

source: Re-order over next/previous pages
th: เรียงลำดับข้ามหน้าก่อน/หน้าถัดไป

source: To re-order a post over next or previous pages, move your cursor on the row you want to re-order and click on move up or move down.
th: การเรียงลำดับข้ามไปยังหน้าก่อนหรือหน้าถัดไป, ให้ย้ายเคอร์เซอร์ไปบนบรรทัดที่คุณต้องการแล้วคลิกที่ย้ายขึ้นหรือย้ายลง.

source: The post that is on top of the list will be move up to previous page, the post that is on bottom of the list will be move down to next page.
th: โพสต์ที่อยู่ด้านบนของรายการจะย้ายขึ้นไปยังหน้าก่อน, โพสต์ที่อยู่ด้านล่างจะย้ายลงไปยังหน้าถัดไป.

source: Manually change order number
th: เปลี่ยนเลขลำดับด้วยตนเอง

source: The manually change order number is very useful if you have many posts and you want some posts from the very bottom of whole list to move to the very top of it.
th: การเปลี่ยนเลขลำดับเอาเองจะมีประโยชน์อย่างมากหากคุณมีหลายๆโพสต์และต้องการย้ายบางโพสต์จากลำดับล่างๆของรายการทั้งหมด ไปยังลำดับบนๆของรายการ.

source: You can just enter the number you want. The lowest number (example: 1) will be display on the last while the highest number will be display first.
th: คุณสามารถกรอกตัวเลขที่ต้องการได้เลย. ตัวเลขที่ต่ำสุด (เช่น 1) จะแสดงรั้งท้าย ขณะที่ตัวเลขที่สูงสุดจะแสดงก่อน.

source: Once you okay with that numbers, please select &quot;Save all changes on order numbers&quot; from bulk actions and click &quot;Apply&quot;.
th: เมื่อคุณลงตัวกับตัวเลขต่างๆแล้ว, โปรดเลือก&quot;บันทึกการเปลี่ยนแปลงตัวเลขทั้งหมด&quot; จากตัวเลือกแล้วคลิก &quot;นำไปใช้&quot;.

source: Re-number and reset
th: เรียงเลขและล้างค่า

source: To re-number all the posts in current listing order, please select &quot;Re-number all posts&quot; from bulk actions and click &quot;Apply&quot;.
th: การเรียงเลขใหม่ทั้งหมดจากลำดับการแสดงที่เห็นอยู่ในปัจจุบัน, ให้เลือก &quot;เรียงเลขโพสต์ใหม่ทั้งหมด&quot; จากตัวเลือกแล้วคลิกที่ปุ่ม &quot;นำไปใช้&quot;.

source: To reset all the posts order by date, please select &quot;Reset all order&quot; from bulk actions and click &quot;Apply&quot;.
th: การล้างค่าใหม่ทั้งหมดโดยเรียงลำดับจากวันที่, ให้เลือก &quot;ล้างค่าใหม่ทั้งหมด&quot; จากตัวเลือกแล้วคลิกที่ปุ่ม &quot;นำไปใช้&quot;.

source: Please note that sticky post can be re-order here because whenever it is unstick then it can be displayed in correct order.
th: โปรดทราบว่าโพสต์ที่ติดหนึบ (sticky) จะยังสามารถเรียงลำดับได้ที่นี่ เพราะว่าเมื่อใดก็ตามที่มันยกเลิกการติดหนึบ มันจะได้แสดงผลออกมาถูกต้อง.

source: Re-order posts
th: จัดเรียงโพสต์

source: Please reload this page and try again.
th: กรุณาโหลดหน้านี้ใหม่แล้วลองอีกครั้ง.

source: Update completed
th: อัพเดทเรียบร้อยแล้ว

source: Error! Unable to re-order the posts due the the currently order number is incorrect. Please click on &quot;Re-number all posts&quot; button to re-number all the posts.
th: ผิดพลาด! ไม่สามารถเรียงลำดับโพสต์ได้เนื่องจากเลขลำดับปัจจุบันไม่ถูกต้อง. โปรดคลิกบนปุ่ม &quot;เรียงเลขโพสต์ใหม่ทั้งหมด&quot; เพื่อเรียงเลขของโพสต์ทั้งหมดเสียใหม่.

source: Unable to re-order the post. The js form did not send required data to re-order. Please reload the page and try again.
th: ไม่สามารถเรียงลำดับโพสต์. ฟอร์ม javascript ไม่ได้ส่งค่าที่ต้องการมาให้ในการเรียงลำดับ. โปรดโหลดหน้านี้ใหม่แล้วลองอีกครั้ง.

source: Unable to re-order the posts. The js form did not send any data to re-order. Please reload the page and try again.
th: ไม่สามารถเรียงลำดับโพสต์. ฟอร์ม javascript ไม่ได้ส่งค่าใดๆให้ในการเรียงลำดับ. โปรดโหลดหน้านี้ใหม่แล้วลองอีกครั้ง.

source: Move up
th: ย้ายขึ้น

source: Move down
th: ย้ายลง

source: Re-number all posts
th: เรียงเลขโพสต์ใหม่ทั้งหมด

source: Reset all order
th: ล้างค่าลำดับทั้งหมด

source: Save all changes on order numbers
th: บันทึกการเปลี่ยนแปลงตัวเลขทั้งหมด

source: Order
th: ลำดับ

source: Rundiz PostOrder settings
th: ตั้งค่า Rundiz PostOrder

source: This settings page is for manage all sites.
th: หน้าตั้งค่านี้สำหรับจัดการกับทุกเว็บไซต์.

source: Remove order numbers
th: เอาเลขลำดับออกทั้งหมด

source: Check this box to remove all post orders number and reset them to zero.
th: เช็คที่กล่องนี้เพื่อล้างค่าลำดับโพสต์ทั้งหมดแล้วกำหนดเป็นศูนย์.

source: Warning! This will be affect on all sites.
th: คำเตือน! นี่จะมีผลกระทบกับเว็บไซต์ทั้งหมด.

source: Are you sure?
th: คุณแน่ใจหรือไม่?

source: Are you sure to doing this? (This may slow down your server if you have too many posts.)
th: คุณแน่ใจหรือไม่ที่จะทำสิ่งนี้? (นี่อาจทำให้เซิร์ฟเวอร์ของคุณทำงานช้าลงถ้าคุณมีโพสต์จำนวนมาก.)

source: Disable on front page
th: ปิดการใช้งานหน้าแรก

source: Disable custom post order on front page.
th: ปิดการจัดเรียงที่หน้าแรก.

source: Disable on categories
th: ปิดการใช้งานบนหมวดหมู่

source: Please tick on the check box of category you want to disable custom post order.
th: โปรดติ๊กบนเช็คบ็อกส์ของหมวดหมู่ที่คุณต้องการปิดใช้การจัดเรียง.
